# Pandas Complete Tutorial
### By Samrat Mitra (https://www.github.com/lionelsamrat10)

## Import Libraries

In [1]:
import pandas as pd
import numpy as np

## Create a Dictionary in Python

In [4]:
dict1 = {
    "name": ['Samrat', 'Sarah', 'Dave', 'Sophie'],
    "marks": [50, 49, 47, 50],
    "city": ['Jalpaiguri', 'Los Angeles', 'Montreal', 'London']
}

## Convert the Dictionary to a Dataframe

***Convert the dictionary dict1 to a dataframe***

In [5]:
df = pd.DataFrame(dict1)

***Print the Dataframe***

In [8]:
df

     name  marks         city
0  Samrat     50   Jalpaiguri
1   Sarah     49  Los Angeles
2    Dave     47     Montreal
3  Sophie     50       London

***Convert the dataframe to csv file***

In [11]:
df.to_csv('students.csv', index = False) # The data will not have any index values

## Get the first few rows of a dataframe

In [12]:
df.head(2)

     name  marks         city
0  Samrat     50   Jalpaiguri
1   Sarah     49  Los Angeles

## Get the last few rows of a dataframe

In [13]:
df.tail(2)

     name  marks      city
2    Dave     47  Montreal
3  Sophie     50    London

## Get the shape of the dataframe

In [14]:
df.shape

(4, 3)

## Get the Description of the data

In [17]:
df.describe() # Performs statistical analysis on the data

           marks
count   4.000000
mean   49.000000
std     1.414214
min    47.000000
25%    48.500000
50%    49.500000
75%    50.000000
max    50.000000

## Read a CSV File

In [18]:
dataframe = pd.read_csv('Salary_Data.csv')

In [19]:
dataframe

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [21]:
dataframe.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [22]:
dataframe.shape

(30, 2)

### Get the Salary of the 10th employee using the dataframe

In [25]:
dataframe['Salary'][9]

57189.0

### Reading a HTML table from the web

In [36]:
# Read HTML tables into a list of DataFrame objects.
url = r'https://en.wikipedia.org/wiki/List_of_Germans_by_net_worth'
tables = pd.read_html(url, header=0)

df_net_worth = tables[0] # tables[0] denotes the first table in the page

# Asserts can be useful for sanity checks
assert len(df_net_worth) > 0 
assert df_net_worth.Name.is_unique


df_net_worth.head() # Shows only the first five entries

,World ranking,Name,Citizenship,Net worth (USD),Sources of wealth
0,34,Beate Heister (b. Albrecht) & Karl Albrecht Jr.,Germany,39.2 billion,Aldi Süd
1,38,Dieter Schwarz,Germany,36.9 billion,Schwarz Gruppe
2,53,Susanne Klatten,Germany,27.7 billion,"BMW, Altana, Nordex, SGL Carbon"
3,58,Klaus-Michael Kühne,Germany,26.3 billion,Kuehne + Nagel
4,81,Stefan Quandt,Germany,21.6 billion,BMW

In [37]:
df_net_worth

,World ranking,Name,Citizenship,Net worth (USD),Sources of wealth
0,34,Beate Heister (b. Albrecht) & Karl Albrecht Jr.,Germany,39.2 billion,Aldi Süd
1,38,Dieter Schwarz,Germany,36.9 billion,Schwarz Gruppe
2,53,Susanne Klatten,Germany,27.7 billion,"BMW, Altana, Nordex, SGL Carbon"
3,58,Klaus-Michael Kühne,Germany,26.3 billion,Kuehne + Nagel
4,81,Stefan Quandt,Germany,21.6 billion,BMW
5,98,Theo Albrecht Jr.,Germany,18.8 billion,Aldi Nord and Trader Joe's
6,115,Reinhold Wuerth,Germany,16.8 billion,Würth Group
7,133,Georg Schaeffler,Germany,14.9 billion,Schaeffler Group
8,186,Alexander Otto,Germany,11.8 billion,Otto Group
9,200,Thomas Strüngmann,Germany,11.0 billion,"Hexal, BioNTech"
10,200,Andreas Strüngmann,Germany,11.0 billion,"Hexal, BioNTech"
11,224,Dietmar Hopp,Germany,10.1 billion,SAP
12,234,Friedhelm Loh,Germany,9.7 billion,Friedhelm Loh Group
13,256,Wolfgang Marguerre,Germany,8.9 billion,Octapharma
14,264,Michael Otto,Germany,8.9 billion,Otto Group
15,269,August von Finck Jr.,Germany,8.8 billion,"Merck Finck & Co., Allianz, Hochtief, Löwenbrä..."
16,297,Hasso Plattner,Germany,8.3 billion,SAP
17,304,Andreas von Bechtolsheim,Germany,8.2 billion,"Sun Microsystems, Arista Networks"
18,369,Ludwig Merckle,Germany,7.0 billion,"Phoenix Pharmahandel, Ratiopharm, HeidelbergCe..."
19,384,Aloys Wobben,Germany,6.8 billion,Enercon
20,384,Erich Wesjohan,Germany,6.8 billion,EW Group
21,404,Horst Julius Pudwill,Germany,6.5 billion,Techtronic Industries
22,421,Axel Oberwelland,Germany,6.3 billion,August Storck
23,451,Guenther Fielmann,Germany,6.0 billion,Fielmann
24,451,Juergen Blickle,Germany,6.0 billion,Eurodrive
25,502,Alexandra Schörghuber,Germany,5.5 billion,Schörghuber Unternehmensgruppe
26,520,Rainer Blickle,Germany,5.4 billion,Eurodrive
27,550,Theo Müller,Germany,5.1 billion,Müller
28,550,Michael Herz,Germany,5.1 billion,"Tchibo, Beiersdorf"
29,550,Wolfgang Herz,Germany,5.1 billion,"Tchibo, Beiersdorf"

### Reading from databases is also possible.

**Reading** from Microsoft SQL using **pyodbc** and **pd.read_sql(sql_code, connection)**.

Methods on DataFrames **return a new instance** by default. In other words, they behave like methods on immutable Python object, and not like methods on mutable objects.

In [38]:
# Lists are MUTABLE
scores = [6, 2, 4, 9, 1]
scores.sort()  # Changes the object in-place, returns None
print(scores)

# Strings are IMMUTABLE
my_name = 'tommy'
my_name = my_name.capitalize()  # A new instance is returned
print(my_name)

[1, 2, 4, 6, 9]
Tommy

### How to changes the index values

In [42]:
df.index = ['first', 'second', 'third', 'fourth']

In [44]:
df # The indices are changed from 0, 1, 2, 3 to first, second, third and fourth

          name  marks         city
first   Samrat     50   Jalpaiguri
second   Sarah     49  Los Angeles
third     Dave     47     Montreal
fourth  Sophie     50       London

### Two data structures in Pandas: Series and DataFrame

In [48]:
type(df['marks']) # Its a Series

pandas.core.series.Series

In [49]:
type(df)

pandas.core.frame.DataFrame

### Create a Pandas Series to store some random numbers

In [50]:
series = pd.Series(np.random.rand(34))

In [51]:
series

0     0.931025
1     0.457479
2     0.900095
3     0.583503
4     0.740396
5     0.985976
6     0.304690
7     0.589111
8     0.133849
9     0.991872
10    0.535326
11    0.684024
12    0.194212
13    0.236177
14    0.893232
15    0.198487
16    0.802577
17    0.769646
18    0.900168
19    0.741213
20    0.412871
21    0.059225
22    0.055967
23    0.565346
24    0.451197
25    0.586177
26    0.895658
27    0.024422
28    0.629172
29    0.982600
30    0.469746
31    0.180316
32    0.537476
33    0.173427
dtype: float64

### Create a Pandas Series to store some random numbers

In [53]:
new_df = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))

In [54]:
new_df

            0         1         2         3         4
0    0.645103  0.909874  0.772714  0.971920  0.447922
1    0.406672  0.462661  0.764455  0.393632  0.980118
2    0.268265  0.942172  0.689656  0.962866  0.480366
3    0.225758  0.446069  0.721748  0.540165  0.294433
4    0.334740  0.651902  0.954042  0.305123  0.323381
..        ...       ...       ...       ...       ...
329  0.484802  0.396057  0.986275  0.206240  0.287740
330  0.275694  0.048875  0.548263  0.026233  0.996112
331  0.766371  0.889653  0.327002  0.513125  0.955522
332  0.974755  0.036153  0.393568  0.760682  0.641273
333  0.113666  0.516478  0.664843  0.206453  0.539210

[334 rows x 5 columns]

In [55]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.514653    0.509198    0.516012    0.506963    0.509086
std      0.285920    0.297670    0.293332    0.284847    0.280513
min      0.000155    0.010953    0.003311    0.009532    0.005277
25%      0.268805    0.262036    0.267722    0.264632    0.287167
50%      0.489789    0.486366    0.533167    0.473689    0.509857
75%      0.772229    0.773088    0.764204    0.763055    0.744210
max      0.999820    0.997521    0.997877    0.999952    0.997636

In [58]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [59]:
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

### Create Transpose of the DataFrame

In [61]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.645103,0.406672,0.268265,0.225758,0.334740,0.896928,0.626353,0.980821,0.136907,0.801126,...,0.433531,0.755803,0.378275,0.480643,0.177254,0.484802,0.275694,0.766371,0.974755,0.113666
1,0.909874,0.462661,0.942172,0.446069,0.651902,0.515101,0.088009,0.354096,0.630575,0.875471,...,0.103127,0.254081,0.481105,0.192492,0.778096,0.396057,0.048875,0.889653,0.036153,0.516478
2,0.772714,0.764455,0.689656,0.721748,0.954042,0.770438,0.602483,0.493543,0.983205,0.268387,...,0.498296,0.751677,0.320666,0.616284,0.578948,0.986275,0.548263,0.327002,0.393568,0.664843
3,0.971920,0.393632,0.962866,0.540165,0.305123,0.408431,0.877930,0.572613,0.073348,0.022865,...,0.664032,0.181776,0.471433,0.531133,0.551473,0.206240,0.026233,0.513125,0.760682,0.206453
4,0.447922,0.980118,0.480366,0.294433,0.323381,0.498782,0.642444,0.128912,0.864935,0.374073,...,0.100304,0.744886,0.917701,0.302836,0.531812,0.287740,0.996112,0.955522,0.641273,0.539210

### Sort the DataFrame in Descending order

In [63]:
new_df.sort_index(axis = 0, ascending = False)

            0         1         2         3         4
333  0.113666  0.516478  0.664843  0.206453  0.539210
332  0.974755  0.036153  0.393568  0.760682  0.641273
331  0.766371  0.889653  0.327002  0.513125  0.955522
330  0.275694  0.048875  0.548263  0.026233  0.996112
329  0.484802  0.396057  0.986275  0.206240  0.287740
..        ...       ...       ...       ...       ...
4    0.334740  0.651902  0.954042  0.305123  0.323381
3    0.225758  0.446069  0.721748  0.540165  0.294433
2    0.268265  0.942172  0.689656  0.962866  0.480366
1    0.406672  0.462661  0.764455  0.393632  0.980118
0    0.645103  0.909874  0.772714  0.971920  0.447922

[334 rows x 5 columns]

### Create a copy of the DataFrame

In [66]:
new_df2 = new_df[:] # We can also do new_df2 = new_df.copy()

In [67]:
new_df2

            0         1         2         3         4
0    0.645103  0.909874  0.772714  0.971920  0.447922
1    0.406672  0.462661  0.764455  0.393632  0.980118
2    0.268265  0.942172  0.689656  0.962866  0.480366
3    0.225758  0.446069  0.721748  0.540165  0.294433
4    0.334740  0.651902  0.954042  0.305123  0.323381
..        ...       ...       ...       ...       ...
329  0.484802  0.396057  0.986275  0.206240  0.287740
330  0.275694  0.048875  0.548263  0.026233  0.996112
331  0.766371  0.889653  0.327002  0.513125  0.955522
332  0.974755  0.036153  0.393568  0.760682  0.641273
333  0.113666  0.516478  0.664843  0.206453  0.539210

[334 rows x 5 columns]

### Update some values of the DataFrame

In [68]:
new_df.loc[0, 0] = 0.547844

In [70]:
new_df.head()

          0         1         2         3         4
0  0.547844  0.909874  0.772714  0.971920  0.447922
1  0.406672  0.462661  0.764455  0.393632  0.980118
2  0.268265  0.942172  0.689656  0.962866  0.480366
3  0.225758  0.446069  0.721748  0.540165  0.294433
4  0.334740  0.651902  0.954042  0.305123  0.323381

In [90]:
new_df.loc[0, 5] = 0.14758

In [91]:
new_df.head()

          0         1         2         3         4        5
0  0.547844  0.909874  0.772714  0.971920  0.447922  0.14758
1  0.406672  0.462661  0.764455  0.393632  0.980118      NaN
2  0.268265  0.942172  0.689656  0.962866  0.480366      NaN
3  0.225758  0.446069  0.721748  0.540165  0.294433      NaN
4  0.334740  0.651902  0.954042  0.305123  0.323381      NaN

### Delete the 5th Column from our DataFrame

In [92]:
new_df = new_df.drop(5, axis = 1) # axis = 1 specifies, that we have to delete the 5th Column

In [93]:
new_df.head()

          0         1         2         3         4
0  0.547844  0.909874  0.772714  0.971920  0.447922
1  0.406672  0.462661  0.764455  0.393632  0.980118
2  0.268265  0.942172  0.689656  0.962866  0.480366
3  0.225758  0.446069  0.721748  0.540165  0.294433
4  0.334740  0.651902  0.954042  0.305123  0.323381

### Get some specified Colums

In [94]:
new_df.loc[[1, 2], [0, 1]]

          0         1
1  0.406672  0.462661
2  0.268265  0.942172

### Get the data from the First Column when entries are greater than 0.3

In [95]:
new_df.loc[(new_df[0] < 0.3)]

            0         1         2         3         4
2    0.268265  0.942172  0.689656  0.962866  0.480366
3    0.225758  0.446069  0.721748  0.540165  0.294433
8    0.136907  0.630575  0.983205  0.073348  0.864935
10   0.190342  0.862562  0.546203  0.536401  0.964384
25   0.048349  0.045761  0.107059  0.808448  0.981382
..        ...       ...       ...       ...       ...
321  0.197955  0.374193  0.225419  0.727813  0.549581
322  0.106474  0.127239  0.253936  0.786246  0.014649
328  0.177254  0.778096  0.578948  0.551473  0.531812
330  0.275694  0.048875  0.548263  0.026233  0.996112
333  0.113666  0.516478  0.664843  0.206453  0.539210

[95 rows x 5 columns]

### Get the data from the First Column when entries are greater than 0.3 and the from the Third Columns having data greater than 0.1

In [99]:
new_df.loc[(new_df[0] < 0.3) & (new_df[2] > 0.1)]

            0         1         2         3         4
2    0.268265  0.942172  0.689656  0.962866  0.480366
3    0.225758  0.446069  0.721748  0.540165  0.294433
8    0.136907  0.630575  0.983205  0.073348  0.864935
10   0.190342  0.862562  0.546203  0.536401  0.964384
25   0.048349  0.045761  0.107059  0.808448  0.981382
..        ...       ...       ...       ...       ...
321  0.197955  0.374193  0.225419  0.727813  0.549581
322  0.106474  0.127239  0.253936  0.786246  0.014649
328  0.177254  0.778096  0.578948  0.551473  0.531812
330  0.275694  0.048875  0.548263  0.026233  0.996112
333  0.113666  0.516478  0.664843  0.206453  0.539210

[88 rows x 5 columns]

### Use of **iloc** Function

#### Get the data from 0th row and 4th column

In [100]:
new_df.head()

          0         1         2         3         4
0  0.547844  0.909874  0.772714  0.971920  0.447922
1  0.406672  0.462661  0.764455  0.393632  0.980118
2  0.268265  0.942172  0.689656  0.962866  0.480366
3  0.225758  0.446069  0.721748  0.540165  0.294433
4  0.334740  0.651902  0.954042  0.305123  0.323381

In [98]:
new_df.iloc[0, 4]

0.44792187251817295

### Check for null values in a column

In [103]:
new_df[2].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 2, Length: 334, dtype: bool

### Drop null values from the DataFrame

In [111]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [112]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

#### Drop the rows where at least one element is missing.

In [115]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

#### Drop the columns where at least one element is missing.

In [114]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

#### Keep only the rows with at least 2 non-NA values.

In [116]:
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

#### Define in which columns to look for missing values.

In [117]:
df.dropna(subset=['name', 'toy'])

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

#### Keep the DataFrame with valid entries in the same variable.

In [118]:
df.dropna(inplace=True)
df

     name        toy       born
1  Batman  Batmobile 1940-04-25

#### Get different values from a column

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 1 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    1 non-null      object
 1   toy     1 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 32.0+ bytes

In [121]:
df['toy'].value_counts(dropna=False)

Batmobile    1
Name: toy, dtype: int64

#### Get the indices, that contains non-null values

In [122]:
df.notnull()

   name   toy  born
1  True  True  True

#### Check the indices for non-null values

In [123]:
df.isnull()

    name    toy   born
1  False  False  False

### Statistical Analysis with Pandas

In [124]:
dataframe.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [125]:
dataframe.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [126]:
dataframe.mean() # Finds mean

YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [133]:
dataframe.corr() #Find pairwise correlation of all columns in the dataframe

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [134]:
dataframe.count() # Counts number of data in the dataframe

YearsExperience    30
Salary             30
dtype: int64

In [135]:
dataframe.max() # Finds the max value from the dataframe

YearsExperience        10.5
Salary             122391.0
dtype: float64

In [136]:
dataframe.min() # Finds the min value from the dataframe

YearsExperience        1.1
Salary             37731.0
dtype: float64

In [137]:
dataframe.median() # Finds the median value from the values in the dataframe

YearsExperience        4.7
Salary             65237.0
dtype: float64

In [141]:
dataframe.std() # Finds the standard deviation value from the values in the dataframe

YearsExperience        2.837888
Salary             27414.429785
dtype: float64